anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
void setHline(const int x1, const int x2, const int y, const iliColr fg)
{
    iliCmd4(ILI9486_COL_ADDR, x1 >> 8, x1, x2 >> 8, x2);
    iliCmd4(ILI9486_PAGE_ADDR, y >> 8, y, y >> 8, y);
    ili9486_fill(fg, 1 + x2 - x1);
}


inline void setPixel(const int x, const int y, const iliColr fg)
{
    iliCmd4(ILI9486_COL_ADDR, x >> 8, x, x >> 8, x);
    iliCmd4(ILI9486_PAGE_ADDR, y >> 8, y, y >> 8, y);
    
    PMADDRbits.CS1 = 1;     // PMCS1 active
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 0;
    PMDIN = ILI9486_MEMORY_WR;
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 1;
    
    while (PMMODEbits.BUSY)
        ;

    PMDIN = fg;     // Actually write the pixel here
    
    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.CS1 = 0;     // PMCS1 inactive
    PMDIN = 0xffff; // Keep data bus high to work around a hardware problem
}


/* hsvto565 --- convert HSV colour to 565-RGB */

iliColr hsvto565(const int ih, const int is, const int iv)
{
    int i;
    uint8_t ir, ig, ib;
    iliColr rgb565;
    double p, q, t;
    double f;
    double h, s, v;
    double r = 0.0, g = 0.0, b = 0.0;

    // Compute H, S, V as floating-point in range 0..360, 0..1 and 0..1
    h = (double)ih * (360.0 / (double)MAXPRI);
    s = is / (double)MAXPRI;
    v = iv / (double)MAXPRI;

    if (is == 0)    /* No saturation so make a grey */
    {
        ir = iv;
        ig = iv;
        ib = iv;
    }
    else
    {
        if (h >= 359.0)
            h = 0.0;

        h /= 60.0;
        i = (int)h;
        f = h - i;

        p = v * (1.0 - s);
        q = v * (1.0 - (s * f));
        t = v * (1.0 - (s * (1.0 - f)));

        switch (i)
        {
        case 0:
            r = v;
            g = t;
            b = p;
            break;
        case 1:
            r = q;
            g = v;
            b = p;
            break;
        case 2:
            r = p;
            g = v;
            b = t;
            break;
        case 3:
            r = p;
            g = q;
            b = v;
            break;
        case 4:
            r = t;
            g = p;
            b = v;
            break;
        case 5:
            r = v;
            g = p;
            b = q;
            break;
        }

        ir = r * MAXPRI;
        ig = g * MAXPRI;
        ib = b * MAXPRI;
    }

    rgb565 = RGB_ILI(ir, ig, ib);

    return (rgb565);
}


/* TRIS_begin --- switch GPIO pins to input or output as required */

static void TRIS_begin(void)
{
    TRISAbits.TRISA7 = 0;   // RA7 pin 92, P3 pin 42 as output (timer toggle)
    TRISAbits.TRISA6 = 0;   // RA6 pin 91, P3 pin 41 as output (LED1)
    TRISBbits.TRISB9 = 0;   // RB9 pin 33, P2 pin 33 as output (LED2)
    
    TRISDbits.TRISD3 = 0;   // RD3 pin 78, P3 pin 28 as output (LCD RESET)
}


void generateGraticule(const struct ColourScheme *cp)
{
    int y;

    for (y = 0; y < GRAT_HT; y++)
    {
        Wgrat[y] = cp->graticule;

        if ((y % GRATICULE) == 0)
            Bgrat[y] = cp->graticule;
        else
            Bgrat[y] = cp->background;

        if ((y % 8) == 0)
            Dgrat[y] = cp->graticule;
        else
            Dgrat[y] = cp->background;

        if ((y == 1) || (y == ((GRAT_HT / 2) + 1)) || (y == ((GRAT_HT / 2) - 1)) || (y == (GRAT_HT - 2)) || ((y % GRATICULE) == 0))
            Tgrat[y] = cp->graticule;
        else
            Tgrat[y] = cp->background;

        if ((y % 2) == 0)
            C1grat[y] = cp->xcursor1;
        else
            C1grat[y] = cp->background;

        if ((y % 2) == 0)
            C2grat[y] = cp->xcursor2;
        else
            C2grat[y] = cp->background;
    }
}


void interpolateY(const uint8_t wave[], const int x, const int yoff, iliColr pixels[], const iliColr colr)
{
    int y1, y2;
    int y;

    y1 = wave[x] + yoff;

    if (x < (GRAT_WD - 1))
        y2 = wave[x + 1] + yoff;
    else
        y2 = y1;

    if ((y1 > 0) && (y1 < GRAT_HT) && (y2 > 0) && (y2 < GRAT_HT))
    {
        if (y2 < y1)
        {
            y = y1;
            y1 = y2;
            y2 = y;
        }

        for (y = y1; y <= y2; y++)
            pixels[y] = colr;
    }
}


void ili9486_renderFont(const int x1, const int y1, const iliColr fg, const iliColr bg, const uint8_t *const str)
{
    const int len = strlen(str);
    const int wd = len * FONT_WD;
    const int ht = FONT_HT;
    const int x2 = x1 + wd - 1;
    const int y2 = y1 + ht - 1;
    int i, row, col;
    uint8_t bits, mask;
    iliColr pixel;
    
    iliCmd4(ILI9486_COL_ADDR, x1 >> 8, x1, x2 >> 8, x2);
    iliCmd4(ILI9486_PAGE_ADDR, y1 >> 8, y1, y2 >> 8, y2);
    
    PMADDRbits.CS1 = 1;     // PMCS1 active
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 0;
    PMDIN = ILI9486_MEMORY_WR;
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 1;
    
    for (row = 0; row < FONT_HT; row++)
    {
        for (i = 0; i < len; i++)
        {
            bits = TileGlyph[str[i]][row];
            
            for (col = 0; col < FONT_WD; col++)
            {
                mask = 0x80 >> col;
                
                if (mask & bits)
                {
                    pixel = fg;
                }
                else
                {
                    pixel = bg;
                }
                
                while (PMMODEbits.BUSY)
                    ;

                PMDIN = pixel;
            }
        }
    }
    
    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.CS1 = 0;     // PMCS1 inactive
    PMDIN = 0xffff; // Keep data bus high to work around a hardware problem
}


void ili9486_renderScaledFont(const int x1, const int y1, const int xmag, const int ymag, const iliColr fg, const iliColr bg, const uint8_t * const str)
{
    const int len = strlen(str);
    const int wd = len * FONT_WD * xmag;
    const int ht = FONT_HT * ymag;
    const int x2 = x1 + wd - 1;
    const int y2 = y1 + ht - 1;
    int i, row, col;
    int x, y;
    uint8_t bits, mask;
    iliColr pixel;

    iliCmd4(ILI9486_COL_ADDR, x1 >> 8, x1, x2 >> 8, x2);
    iliCmd4(ILI9486_PAGE_ADDR, y1 >> 8, y1, y2 >> 8, y2);

    PMADDRbits.CS1 = 1; // PMCS1 active

    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.ADDR = 0;
    PMDIN = ILI9486_MEMORY_WR;

    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.ADDR = 1;

    for (row = 0; row < FONT_HT; row++)
    {
        for (y = 0; y < ymag; y++)
        {
            for (i = 0; i < len; i++)
            {
                bits = TileGlyph[str[i]][row];

                for (col = 0; col < FONT_WD; col++)
                {
                    mask = 0x80 >> col;

                    if (mask & bits)
                    {
                        pixel = fg;
                    }
                    else
                    {
                        pixel = bg;
                    }

                    for (x = 0; x < xmag; x++)
                    {
                        while (PMMODEbits.BUSY)
                            ;

