anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
                        PMDIN = pixel;
                    }
                }
            }
        }
    }

    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.CS1 = 0; // PMCS1 inactive
    PMDIN = 0xffff; // Keep data bus high to work around a hardware problem
}


/* setLine --- draw a line between any two absolute co-ords */

void setLine(int x1, int y1, int x2, int y2, const iliColr fg)
{
    int d;
    int i1, i2;
    int x, y;
    const int dx = abs(x2 - x1);
    const int dy = abs(y2 - y1);

    if (((y1 > y2) && (dx < dy)) || ((x1 > x2) && (dx > dy)))
    {
        int temp = y1;
        y1 = y2;
        y2 = temp;

        temp = x1;
        x1 = x2;
        x2 = temp;
    }

    if (dy > dx)
    {
        int xinc;
        int yend;
        
        d = (2 * dx) - dy;       /* Slope > 1 */
        i1 = 2 * dx;
        i2 = 2 * (dx - dy);

        if (y1 > y2)
        {
            x = x2;
            y = y2;
            yend = y1;
        }
        else
        {
            x = x1;
            y = y1;
            yend = y2;
        }

        if (x1 > x2)
            xinc = -1;
        else
            xinc = 1;

        setPixel(x, y, fg);

        while (y < yend)
        {
            y++;
            
            if (d < 0)
                d += i1;
            else
            {
                x += xinc;
                d += i2;
            }

            setPixel(x, y, fg);
        }
    }
    else
    {
        int xend;
        int yinc;
        
        d = (2 * dy) - dx;  /* Slope < 1 */
        i1 = 2 * dy;
        i2 = 2 * (dy - dx);

        if (x1 > x2)
        {
            x = x2;
            y = y2;
            xend = x1;
        }
        else
        {
            x = x1;
            y = y1;
            xend = x2;
        }

        if (y1 > y2)
            yinc = -1;
        else
            yinc = 1;

        setPixel(x, y, fg);

        while (x < xend)
        {
            x++;
            
            if (d < 0)
                d += i1;
            else
            {
                y += yinc;
                d += i2;
            }

            setPixel(x, y, fg);
        }
    }
}


/* ellipse --- draw an ellipse using Bresenham's algorithm */

void ellipse(int x0, int y0, int x1, int y1, const int fg)
{
    // Based on code from http://members.chello.at/~easyfilter/bresenham.html
    int a = abs(x1 - x0);
    int b = abs(y1 - y0);
    int b1 = b & 1;
    int dx = 4L * (1 - a) * b * b;
    int dy = 4L * (b1 + 1) * a * a;
    int err = dx + dy + (b1 * a * a);
    int e2;

    if (x0 > x1)
    {
        x0 = x1;
        x1 += a;
    }

    if (y0 > y1)
    {
        y0 = y1;
    }

    y0 += (b + 1) / 2;
    y1 = y0 - b1;

    a *= 8 * a;
    b1 = 8 * b * b;

    do
    {
        setHline(x0, x1, y0, fg);
        setHline(x0, x1, y1, fg);

        e2 = 2 * err;

        if (e2 <= dy)
        {
            y0++;
            y1--;
            err += dy += a;
        }

        if ((e2 >= dx) || ((2L * err) > dy))
        {
            x0++;
            x1--;
            err += dx += b1;
        }
    } while (x0 <= x1);

    while ((y0 - y1) < b)
    { 
        setHline(x0 - 1, x1 + 1, y0++, fg);
        setHline(x0 - 1, x1 + 1, y1--, fg);
    }
}


static void cpts(const int x0, const int y0, const int x, const int y, const iliColr fg)
{
    setHline(x0 - x, x0 + x, y0 + y, fg);
    setHline(x0 - x, x0 + x, y0 - y, fg);
    setHline(x0 - y, x0 + y, y0 + x, fg);
    setHline(x0 - y, x0 + y, y0 - x, fg);
}


/* circle --- draw a circle using Michener's algorithm */

void circle(const int x0, const int y0, const int r, const iliColr fg)
{
    int x, y;
    int d;

    x = 0;
    y = r;
    d = 3 - (2 * r);

    while (x < y)
    {
        cpts (x0, y0, x, y, fg);

        if (d < 0)
        {
            d += (4 * x) + 6;
        }
        else
        {
            d += (4 * (x - y)) + 10;
            y--;
        }

        x++;
    }

    if (x == y)
       cpts(x0, y0, x, y, fg);
}


void main(void)
{
    unsigned int before, after;
    int i, x, y;
    uint8_t str[32];
    iliColr pixels[GRAT_HT];
    uint8_t wave1[GRAT_WD];
    uint8_t wave2[GRAT_WD];
    uint8_t wave3[GRAT_WD];
    uint8_t wave4[GRAT_WD];
    uint16_t xx[256], yy[256];
    float theta1, delta1;
    float theta2, delta2;
    float offset1 = 128.0;
    float offset2 = 192.0;
    bool cursorMode = true;
    int xcursor1 = 34, xcursor2 = 241;
    int ycursor1 = 54, ycursor2 = 237;
    int yshift1 = 22;
    int yshift2 = -22;
    int yshift3 = 64;
    int yshift4 = 32;
    static uint16_t pixMap[64] = {0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f,  // blue
                                  0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f, 0x001f,  // blue
                                  0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0,  // green
                                  0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0, 0x07e0,  // green
                                  0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800,  // red
                                  0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800, 0xf800,  // red
                                  0xffff, 0x0000, 0xffff, 0x0000, 0xffff, 0x0000, 0xffff, 0x0000,  // black/white
                                  0x0000, 0xffff, 0x0000, 0xffff, 0x0000, 0xffff, 0x0000, 0xffff}; // black/white
    
    /* Set up peripherals to match pin connections on PCB */
    PPS_begin();
    
    /* Configure tri-state registers */
    TRIS_begin();
    
    UART3_begin(9600);
    
    PMP_begin();
    
    /* Configure Timer 1 */
    T1CONbits.TCKPS = 0;        // Timer 1 prescale: 1
    
    TMR1 = 0x00;                // Clear Timer 1 counter
    PR1 = 39999;                // Interrupt every 40000 ticks (1ms)
    
    T1CONbits.ON = 1;           // Enable Timer 1
    
    /* Configure interrupts */
    INTCONSET = _INTCON_MVEC_MASK; // Multi-vector mode
    
    IPC1bits.T1IP = 2;          // Timer 1 interrupt priority 2
    IPC1bits.T1IS = 1;          // Timer 1 interrupt sub-priority 1
    IFS0CLR = _IFS0_T1IF_MASK;  // Clear Timer 1 interrupt flag
    IEC0SET = _IEC0_T1IE_MASK;  // Enable Timer 1 interrupt
    
    __asm__("EI");              // Global interrupt enable
    
    puts("ILI9486TEST");
    
    ili9486_begin();
    
    generateGraticule(&LCDColours);
    
    // Synthesise four dummy waveforms
    delta1 = (M_PI * 4.0) / (float)GRAT_WD;
    delta2 = (M_PI * 8.0) / (float)GRAT_WD;

    for (x = 0; x < GRAT_WD; x++)
    {
        theta1 = (float)x * delta1;
        theta2 = (float)x * delta2;

        wave1[x] = (sin(theta1) * 50.0) + offset1;
        wave2[x] = (sin(theta2) * 50.0) + offset2;
        wave3[x] = sin(theta1) > 0.0? 32: 0;
        wave4[x] = sin(theta2) > 0.0? 32: 0;
    }
   
    
    ili9486_fill(ILI9486_WHITE, 480u * 320u);
    
    while (1)
    {
        LED1 = 0;
        LED2 = 1;
        ili9486_fillRect(0, 0, 319, 0, ILI9486_WHITE);
        
        delayms(500);
               
